# MEPAnalytical Segment Override Type Property

Source: https://www.revitapidocs.com/2026/6bb08b76-c00b-a12f-a334-c76e41d26947.htm

---

| MEPAnalytical Segment Override Type Property |
| --- |

The override type of analytical segment pressure loss calculation.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public SegmentOverrideType OverrideType { get; }
```

```
Public ReadOnly Property OverrideType As SegmentOverrideType
	Get
```

```
public:
property SegmentOverrideType OverrideType {
	SegmentOverrideType get ();
}
```

```
member OverrideType : SegmentOverrideType with get
```

#### Property Value

SegmentOverrideType See Also

#### Reference

MEPAnalyticalSegment Class Autodesk.Revit.DB.Analysis Namespace